FirstImpressions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>FirstImpressions</title>
<!-- 2018-04-04 qua 13:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anna" />
</head>
<body>
<div id="content">
<h1 class="title">FirstImpressions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Aspectos visuais</a></li>
<li><a href="#sec-2">2. Aspectos textuais</a></li>
<li><a href="#sec-3">3. Aspectos organizacionais</a></li>
</ul>
</div>
</div>
<p>
Este documento nada mais é do que uma lista de aspectos da documentação do Tainacan cujo aprimoramento precisa ser considerado. Tenha em mente de que ele é um reflexo de minhas experiências ao explorar a atual wiki do Tainacan e vivências passadas no mundo do software livre — portanto, está aberto a diferentes perspectivas e sugestões.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Aspectos visuais</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Imagens sem texto associado (ou texto alternativo)  detalhado. 
<ul class="org-ul">
<li><b><b>Acessibilidade:</b></b> Quando um usuário com deficiência visual usa leitores de tela, o software utiliza o atributo "texto associado" como descrição daquele elemento visual.
</li>
<li><b><b>SEO:</b></b> Mecanismos de busca também utilizam tal atributo para exibir resultados específicos.
</li>
<li><b><b>Padronização de nomes de arquivo:</b></b> Outro aspecto a ser considerado para aprimoramento da gestão de arquivos.
</li>
</ul>
</li>

<li>Imagens de baixa qualidade.
<ul class="org-ul">
<li><b><b>Legibilidade:</b></b> Dada a importância de tal recurso 
</li>
</ul>
</li>
</ol>

<p>
visual para a orientação do usuário final, é importante que capturas de tela sejam disponibilizadas em alta qualidade.
</p>
<ul class="org-ul">
<li><b><b>Formato:</b></b> Notei que as imagens disponibilizadas estão no formato .png. Acredito que não seja necessário, visto que é possível utilizar imagens no formato .jpg sem perda de qualidade, mas diminuindo o uso de armazenamento nos servidores.
</li>

<li>Indicações de elementos citados ou em foco.
<ul class="org-ul">
<li>Em vários momentos, a documentação procura fazer com que o leitor foque o seu olhar em elementos específicos de determinadas telas. Aqui, o problema é a falta de um padrão: em um momento, isso é feito através de números azuis, sem sombra; em outro, com setas vermelhas; em outro, com números vermelhos com sombras.
</li>
<li>Uma solução mais elegante seria capturas de tela de alta qualidade dos elementos citados, como acontece em documentações como o da extensão <a href="https://www.mediawiki.org/wiki/Help:VisualEditor/User_guide">VisualEditor</a> do MediaWiki.
</li>
</ul>
</li>

<li>Ausência de imagens em pontos críticos da documentação.
<ul class="org-ul">
<li>Provavelmente uma consequência da migração da documentação para a wiki.
</li>
<li>Exemplos: "Minha Coleção" (a partir da imagem 137), "Gestão do Repositório" (diversos trechos).
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Aspectos textuais</h2>
<div class="outline-text-2" id="text-2">
<p>
Acredito que todos os pontos levantados podem ser aprimorados através da introdução de um guia de estilo para a documentação. Tal ação tem, como benefícios:
</p>

<ul class="org-ul">
<li>O estabelecimento de uma identidade textual para o projeto.
</li>
<li>A padronização da linguagem da documentação.
</li>
<li>A entrada facilitada a novos membros do projeto.
</li>
<li>A criação de documentação-legado.
</li>
</ul>

<p>
Um guia de estilo não é:
</p>

<ul class="org-ul">
<li>Um artifício para podar escritores técnicos.
</li>
<li>Uma rejeição a ideias criativas.
</li>
<li>Uma obrigação inflexível.
</li>
</ul>

<p>
Um guia de estilo é:
</p>
<ul class="org-ul">
<li>Uma ferramenta para facilitar o trabalho dos escritores técnicos.
</li>
<li>Um recurso para tornar a escrita de documentação um processo mais fácil.
</li>
</ul>

<p>
Dentre os problemas latentes detectados, estão:
</p>

<ol class="org-ol">
<li>Ausência de uma linguagem uniforme por toda a extensão da documentação.
<ul class="org-ul">
<li>Diretrizes a respeito da linguagem mais adequada ajudam o texto a se tornar mais coeso.
</li>
</ul>
</li>

<li>Sentenças muito longas, exaustivas de se ler.
<ul class="org-ul">
<li>Sentenças curtas fazem melhor proveito da atenção do leitor. Além disso, tornam mais fáceis pausas durante a leitura.
</li>
</ul>
</li>

<li>Estrangeirismos
<ul class="org-ul">
<li>Um exemplo persistente é "setar".
</li>
<li>Apesar de uma linguagem mais informal ser encorajada para não intimidar o usuário novato, o uso desse tipo de vocabulário deve ser evitado para não confundí-lo.
</li>
</ul>
</li>
</ol>


<ol class="org-ol">
<li>Us extensivo de termos em inglês 
<ul class="org-ul">
<li>O uso de termos equivalentes em inglês provavelmente intimidaria menos quem tem um menor grau técnico.
</li>
<li>Ainda que se tratasse de um público com um grau técnico consistente, questiono a necessidade de usar somente termos anglófonos em determinadas situações ao invés de oferecer informações e telas de usuário totalmente traduzidas.
</li>
<li>É possível argumentar que grande parte das pessoas possuem familiaridade com certos termos, e que traduzí-los seja um esforço em vão. Por isso, o interessante seria introduzir convenções nestes casos.
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Aspectos organizacionais</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Espaços nominais
<ul class="org-ul">
<li>O uso de espaos nominais para categorizar documentação é um artíficio útil para direcionar públicos distintos às páginas adequadas.
</li>
<li>Tal qual como o MediaWiki.org, "Help:" poderia designar guias de usuário e "Manual:", artigos específicos para desenvolvedores, mantenedores, administradores.
</li>
<li>É de imensa importância que não se misture textos técnicos para públicos-alvo distintos. A página principal precisa, com sucesso, direcionar cada um para a seção adequada.
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Anna</p>
<p class="date">Created: 2018-04-04 qua 13:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
